* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment
** Elapsed time
#+PLOT: title:"Elapsed time (No derailment)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.002 |    0.003 | 2.3333333e-3 |
| Example with two trains    |    0.024 |    0.016 |    0.019 |  0.019666667 |
| Shared Segment             |    0.024 |    0.023 |    0.024 |  0.023666667 |
| Large Network              |    0.018 |    0.015 |    0.017 |  0.016666667 |
| Station One                |     0.01 |    0.018 |     0.01 |  0.012666667 |
| Station Two                |    0.076 |    0.076 |    0.076 |        0.076 |
| Station Four               |    1.732 |    1.727 |    1.781 |    1.7466667 |
| Station Six                |   30.302 |   29.373 |   29.754 |    29.809667 |
| Station Eight              |   169.02 |  169.684 |  171.222 |    169.97533 |
| Station Ten                |  597.211 |  599.872 |  602.294 |    599.79233 |
| Station Twelfth            | 1721.608 | 1751.177 | 1733.154 |     1735.313 |
| Two trains same direction  |    0.023 |    0.019 |    0.019 |  0.020333333 |
| Four trains same direction |  1720.46 | 1765.467 | 1763.612 |    1749.8463 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No derailment)" deps:(5) set:"xrange[0:]"
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   6.028 |   6.032 |   6.036 |     6.032 |
| Example with two trains    |   6.928 |   6.164 |   6.164 | 6.4186667 |
| Shared Segment             |   7.012 |   7.012 |   7.012 |     7.012 |
| Large Network              |   8.528 |   8.528 |   8.528 |     8.528 |
| Station One                |   6.124 |   6.116 |   6.124 | 6.1213333 |
| Station Two                |   8.828 |   8.828 |   8.836 | 8.8306667 |
| Station Four               |  25.536 |  25.528 |  25.536 | 25.533333 |
| Station Six                |  69.904 |  69.900 |  69.900 | 69.901333 |
| Station Eight              | 205.464 | 158.696 | 158.696 | 174.28533 |
| Station Ten                | 312.980 | 312.984 | 312.980 | 312.98133 |
| Station Twelfth            | 715.836 | 715.836 | 554.640 |   662.104 |
| Two trains same direction  |   7.012 |   7.020 |   7.020 | 7.0173333 |
| Four trains same direction | 992.472 | 992.468 | 992.600 | 992.51333 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
#+PLOT: title:"Elapsed time (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.003 |    0.003 | 2.6666667e-3 |
| Example with two trains    |     0.02 |     0.03 |    0.021 |  0.023666667 |
| Shared Segment             |    0.016 |    0.017 |    0.017 |  0.016666667 |
| Large Network              |    0.012 |    0.016 |    0.013 |  0.013666667 |
| Station One                |    0.014 |    0.015 |     0.01 |        0.013 |
| Station Two                |    0.076 |    0.091 |    0.079 |        0.082 |
| Station Four               |    1.731 |    1.769 |      1.8 |    1.7666667 |
| Station Six                |   30.639 |   30.258 |   30.445 |    30.447333 |
| Station Eight              |  170.202 |  170.379 |  170.058 |      170.213 |
| Station Ten                |  598.953 |  602.536 |  594.982 |    598.82367 |
| Station Twelfth            | 1746.811 | 1739.701 | 1749.168 |    1745.2267 |
| Two trains same direction  |     0.02 |    0.019 |    0.014 |  0.017666667 |
| Four trains same direction | 1728.032 | 1761.575 | 1760.311 |    1749.9727 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.644 |   5.644 |   5.644 |     5.644 |
| Example with two trains    |   6.168 |   6.164 |   6.160 |     6.164 |
| Shared Segment             |   7.008 |   7.008 |   7.008 |     7.008 |
| Large Network              |   8.532 |   8.528 |   8.528 | 8.5293333 |
| Station One                |   6.124 |   6.124 |   6.124 |     6.124 |
| Station Two                |   8.836 |   8.832 |   8.836 | 8.8346667 |
| Station Four               |  25.532 |  25.536 |  25.532 | 25.533333 |
| Station Six                |  69.900 |  69.900 |  69.900 |      69.9 |
| Station Eight              | 158.692 | 158.692 | 158.692 |   158.692 |
| Station Ten                | 312.980 | 409.204 | 295.724 | 339.30267 |
| Station Twelfth            | 554.636 | 715.832 | 715.828 | 662.09867 |
| Two trains same direction  |   7.020 |   7.020 |   7.020 |      7.02 |
| Four trains same direction | 992.476 | 992.476 | 992.480 | 992.47733 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
#+PLOT: title:"Elapsed time (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.003 |    0.002 | 2.3333333e-3 |
| Example with two trains    |    0.023 |    0.022 |    0.012 |        0.019 |
| Shared Segment             |    0.027 |    0.024 |    0.017 |  0.022666667 |
| Large Network              |    0.021 |    0.021 |    0.018 |         0.02 |
| Station One                |    0.018 |     0.02 |     0.01 |        0.016 |
| Station Two                |    0.077 |    0.076 |     0.07 |  0.074333333 |
| Station Four               |    1.758 |    1.724 |    1.677 |    1.7196667 |
| Station Six                |   29.659 |   30.163 |   29.537 |    29.786333 |
| Station Eight              |   169.82 |   168.42 |  168.161 |    168.80033 |
| Station Ten                |   596.33 |  592.226 |  595.943 |      594.833 |
| Station Twelfth            | 1731.253 |  1720.88 | 1705.057 |    1719.0633 |
| Two trains same direction  |    0.022 |    0.013 |    0.018 |  0.017666667 |
| Four trains same direction | 1701.019 | 1773.739 | 1712.154 |    1728.9707 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.632 |   5.632 |   5.632 |     5.632 |
| Example with two trains    |   6.144 |   6.144 |   6.144 |     6.144 |
| Shared Segment             |   6.988 |   6.988 |   6.988 |     6.988 |
| Large Network              |   8.528 |   8.524 |   8.524 | 8.5253333 |
| Station One                |   6.100 |   6.104 |   6.104 | 6.1026667 |
| Station Two                |   8.824 |   8.824 |   8.824 |     8.824 |
| Station Four               |  25.500 |  25.504 |  25.504 | 25.502667 |
| Station Six                |  69.828 |  69.828 |  69.828 |    69.828 |
| Station Eight              | 158.484 | 158.484 | 158.484 |   158.484 |
| Station Ten                | 312.440 | 312.440 | 408.664 | 344.51467 |
| Station Twelfth            | 553.516 | 553.516 | 553.516 |   553.516 |
| Two trains same direction  |   7.000 |   6.996 |   7.000 | 6.9986667 |
| Four trains same direction | 992.448 | 992.444 | 992.444 | 992.44533 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)
